IsaiahGrace/TFT_22_ILI9225_STM32F0/src/TFT_22_ILI9225.cpp
#include "stm32f0xx.h"
//#include "stm32f0_discovery.h" // DOESN'T SEEM TO BE NEEDED
#include "TFT_22_ILI9225.h"

//#define DEBUG_PRINT
#ifdef DEBUG_PRINT
    // THis needs porting to the STM32F0. It will not work as is (I think).
    //#define DB_PRINT( x, ... ) { char dbgbuf[60]; sprintf_P( dbgbuf, (const char*) F( x ), __VA_ARGS__ ) ; Serial.print( dbgbuf ); }
    #define DB_PRINT( ... ) { char dbgbuf[60]; sprintf( dbgbuf,   __VA_ARGS__ ) ; Serial.println( dbgbuf ); }
#else
    #define DB_PRINT(  ... ) ;
#endif

// STM    Meaning      DISP
// ----------------------------
// PA3 -> nRESET    -> RST
// PA4 -> NSS (MAN) -> CS
// PA5 -> SPI1_SCK  -> CLK
// PA6 -> DATA/CMD  -> RS
// PA7 -> SPI1_MOSI -> SDI
// +5v -> BackLight -> LED (This is PWM dimmable)
// +5v -> Power     -> Vcc
// GND -> Ground    -> GND

#ifndef pgm_read_byte
 #define pgm_read_byte(addr) (*(const unsigned char *)(addr))
#endif
#ifndef pgm_read_word
 #define pgm_read_word(addr) (*(const unsigned short *)(addr))
#endif
#ifndef pgm_read_dword
 #define pgm_read_dword(addr) (*(const unsigned long *)(addr))
#endif

#define pgm_read_pointer(addr) ((void *)pgm_read_word(addr))

// Control pins
#define SPI_DC_HIGH()           GPIOA->ODR |=  _rs //digitalWrite(_rs, HIGH)
#define SPI_DC_LOW()            GPIOA->ODR &= ~_rs //digitalWrite(_rs, LOW)
#define SPI_CS_HIGH()           GPIOA->ODR |=  _cs //digitalWrite(_cs, HIGH)
#define SPI_CS_LOW()            GPIOA->ODR &= ~_cs //digitalWrite(_cs, LOW)

//Software SPI Macros
#define SSPI_MOSI_HIGH()        GPIOA->ODR |=  _sdi //digitalWrite(_sdi, HIGH)
#define SSPI_MOSI_LOW()         GPIOA->ODR &= ~_sdi //digitalWrite(_sdi, LOW)
#define SSPI_SCK_HIGH()         GPIOA->ODR |=  _sdi //digitalWrite(_clk, HIGH)
#define SSPI_SCK_LOW()          GPIOA->ODR &= ~_sdi //digitalWrite(_clk, LOW)

// Simple Constructor
TFT_22_ILI9225::TFT_22_ILI9225() {
    // STM    Meaning      DISP
    // ----------------------------
    // PA3 -> nRESET    -> RST
    // PA4 -> NSS (MAN) -> CS
    // PA5 -> SPI1_SCK  -> CLK
    // PA6 -> DATA/CMD  -> RS
    // PA7 -> SPI1_MOSI -> SDI
    // +5v -> BackLight -> LED (This is PWM dimmable, but not implemented in this library)
    // +5v -> Power     -> Vcc
    // GND -> Ground    -> GND

    _rst  = GPIO_ODR_3;
    _rs   = GPIO_ODR_6;
    _cs   = GPIO_ODR_4;
    _sdi  = GPIO_ODR_7;
    _clk  = GPIO_ODR_5;
    _led  = 0; // This library does not use LED backlight control at the moment

    // Enable GPIO Port A clock
    RCC->AHBENR |= RCC_AHBENR_GPIOAEN;

    // Set Pins PA3 PA4 PA5 PA6 PA7 to Output
    GPIOA->MODER &= ~0x0000ffc0;
    GPIOA->MODER |=  0x00005540;

    // Set Clock to HIGH for IDLE state
    GPIOA->ODR |= GPIO_ODR_5;

    // Pull SS high
    GPIOA->ODR |= GPIO_ODR_4;

    // pull RS low
    GPIOA->ODR &= ~GPIO_ODR_6;

    // Set orientation
    _orientation = 0; // 0=portrait, 1=right rotated landscape, 2=reverse portrait, 3=left rotated landscape

    // Set gfxFont to NULL for now
    //gfxFont = NULL;

    // Set maxX and maxY
    _maxX = maxX();
    _maxY = maxY();

    // Set Background color
    _bgColor = COLOR_BLACK;
}

void TFT_22_ILI9225::begin() {
    // Initialization Code -- Power ON RESET
    GPIOA->ODR |= GPIO_ODR_3; // Pull the reset pin high to release the ILI9225C from the reset status
    _delay(1);
    GPIOA->ODR &= ~GPIO_ODR_3;  // Pull the reset pin low to reset ILI9225
    _delay(10);
    GPIOA->ODR |= GPIO_ODR_3;  // Pull the reset pin high to release the ILI9225C from the reset status
    _delay(50);

    /* Start Initial Sequence */

    /* Set SS bit and direction output from S528 to S1 */
    startWrite();
    _writeRegister(ILI9225_POWER_CTRL1, 0x0000); // Set SAP,DSTB,STB
    _writeRegister(ILI9225_POWER_CTRL2, 0x0000); // Set APON,PON,AON,VCI1EN,VC
    _writeRegister(ILI9225_POWER_CTRL3, 0x0000); // Set BT,DC1,DC2,DC3
    _writeRegister(ILI9225_POWER_CTRL4, 0x0000); // Set GVDD
    _writeRegister(ILI9225_POWER_CTRL5, 0x0000); // Set VCOMH/VCOML voltage
    endWrite();
    _delay(40);

    // Power-on sequence
    startWrite();
    _writeRegister(ILI9225_POWER_CTRL2, 0x0018); // Set APON,PON,AON,VCI1EN,VC
    _writeRegister(ILI9225_POWER_CTRL3, 0x6121); // Set BT,DC1,DC2,DC3
    _writeRegister(ILI9225_POWER_CTRL4, 0x006F); // Set GVDD   /*007F 0088 */
    _writeRegister(ILI9225_POWER_CTRL5, 0x495F); // Set VCOMH/VCOML voltage
    _writeRegister(ILI9225_POWER_CTRL1, 0x0800); // Set SAP,DSTB,STB
    endWrite();
    _delay(10);
    startWrite();
    _writeRegister(ILI9225_POWER_CTRL2, 0x103B); // Set APON,PON,AON,VCI1EN,VC
    endWrite();
    _delay(50);

    startWrite();
    _writeRegister(ILI9225_DRIVER_OUTPUT_CTRL, 0x011C); // set the display line number and display direction
    _writeRegister(ILI9225_LCD_AC_DRIVING_CTRL, 0x0100); // set 1 line inversion
    _writeRegister(ILI9225_ENTRY_MODE, 0x1038); // set GRAM write direction and BGR=1.
    _writeRegister(ILI9225_DISP_CTRL1, 0x0000); // Display off
    _writeRegister(ILI9225_BLANK_PERIOD_CTRL1, 0x0808); // set the back porch and front porch
    _writeRegister(ILI9225_FRAME_CYCLE_CTRL, 0x1100); // set the clocks number per line
    _writeRegister(ILI9225_INTERFACE_CTRL, 0x0000); // CPU interface
    _writeRegister(ILI9225_OSC_CTRL, 0x0D01); // Set Osc  /*0e01*/
    _writeRegister(ILI9225_VCI_RECYCLING, 0x0020); // Set VCI recycling
    _writeRegister(ILI9225_RAM_ADDR_SET1, 0x0000); // RAM Address
    _writeRegister(ILI9225_RAM_ADDR_SET2, 0x0000); // RAM Address

    /* Set GRAM area */
    _writeRegister(ILI9225_GATE_SCAN_CTRL, 0x0000); 
    _writeRegister(ILI9225_VERTICAL_SCROLL_CTRL1, 0x00DB); 
    _writeRegister(ILI9225_VERTICAL_SCROLL_CTRL2, 0x0000); 
    _writeRegister(ILI9225_VERTICAL_SCROLL_CTRL3, 0x0000); 
    _writeRegister(ILI9225_PARTIAL_DRIVING_POS1, 0x00DB); 
    _writeRegister(ILI9225_PARTIAL_DRIVING_POS2, 0x0000); 
    _writeRegister(ILI9225_HORIZONTAL_WINDOW_ADDR1, 0x00AF); 
    _writeRegister(ILI9225_HORIZONTAL_WINDOW_ADDR2, 0x0000); 
    _writeRegister(ILI9225_VERTICAL_WINDOW_ADDR1, 0x00DB); 
    _writeRegister(ILI9225_VERTICAL_WINDOW_ADDR2, 0x0000); 

    /* Set GAMMA curve */
    _writeRegister(ILI9225_GAMMA_CTRL1, 0x0000); 
    _writeRegister(ILI9225_GAMMA_CTRL2, 0x0808); 
    _writeRegister(ILI9225_GAMMA_CTRL3, 0x080A); 
    _writeRegister(ILI9225_GAMMA_CTRL4, 0x000A); 
    _writeRegister(ILI9225_GAMMA_CTRL5, 0x0A08); 
    _writeRegister(ILI9225_GAMMA_CTRL6, 0x0808); 
    _writeRegister(ILI9225_GAMMA_CTRL7, 0x0000); 
    _writeRegister(ILI9225_GAMMA_CTRL8, 0x0A00); 
    _writeRegister(ILI9225_GAMMA_CTRL9, 0x0710); 
    _writeRegister(ILI9225_GAMMA_CTRL10, 0x0710); 

