IsaiahGrace/TFT_22_ILI9225_STM32F0/src/TFT_22_ILI9225.cpp
    _writeRegister(ILI9225_DISP_CTRL1, 0x0012); 
    endWrite();
    _delay(50);
    startWrite();
    _writeRegister(ILI9225_DISP_CTRL1, 0x1017);
    endWrite();

    // Turn on backlight
    setBacklight(true); // does nothing right now...
    setOrientation(0);

    // Initialize variables
    setBackgroundColor(COLOR_BLACK);

    clear();
}

// ----------------------------------------------------------------------------
// Functions added for STM32F0 Port
// ----------------------------------------------------------------------------

void TFT_22_ILI9225::_delay(unsigned int ms) {
    _nano_wait(ms * 1000000);
}

void TFT_22_ILI9225::_nano_wait(unsigned int ns) {
    // Taken from Purdue ECE362 course materials
    asm(    "        mov r0,%0\n"
            "repeat: sub r0,#83\n"
            "        bgt repeat\n" : : "r"(ns) : "r0", "cc");
}

uint16_t TFT_22_ILI9225::_min(uint16_t a, uint16_t b) {
    return a > b ? b : a;
}

uint16_t TFT_22_ILI9225::_abs(int16_t a) {
    // If a is less than zero, flip all the bits and add one.
    return a < 0 ? (uint16_t) ~a + 1 : a;
}

int TFT_22_ILI9225::_strlen(STRING str) {
    int i;
    for (i = 0; str[i] != '\0'; i++) ;
    return i;
}

int TFT_22_ILI9225::_bitRead(uint8_t byte, int k) {
    return (byte >> k) & 0x1;
}

// ----------------------------------------------------------------------------
// END of new functions
// ----------------------------------------------------------------------------

void TFT_22_ILI9225::_spiWrite(uint8_t b) {
    for (uint8_t bit = 0x80; bit; bit >>= 1) {
        if (b & bit) {
            // Data is 1, set MOSI to high
            GPIOA->ODR |= _sdi;
        } else {
            // Data is 0, set MOSI to low
            GPIOA->ODR &= ~_sdi;
        }
        GPIOA->ODR |=  _clk;
        GPIOA->ODR &= ~_clk;
    }
}

void TFT_22_ILI9225::_spiWriteCommand(uint8_t c) {
    SPI_DC_LOW();
    SPI_CS_LOW();
    _spiWrite(c);
    SPI_CS_HIGH();
}


void TFT_22_ILI9225::_spiWriteData(uint8_t c) {
    SPI_DC_HIGH();
    SPI_CS_LOW();
    _spiWrite(c);
    SPI_CS_HIGH();
}

void TFT_22_ILI9225::_orientCoordinates(uint16_t &x1, uint16_t &y1) {

    switch (_orientation) {
    case 0:  // ok
        break;
    case 1: // ok
        y1 = _maxY - y1 - 1;
        _swap(x1, y1);
        break;
    case 2: // ok
        x1 = _maxX - x1 - 1;
        y1 = _maxY - y1 - 1;
        break;
    case 3: // ok
        x1 = _maxX - x1 - 1;
        _swap(x1, y1);
        break;
    }
}

void TFT_22_ILI9225::_setWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {
    _setWindow( x0, y0, x1, y1, TopDown_L2R ); // default for drawing characters
}

void TFT_22_ILI9225::_setWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, autoIncMode_t mode) {
    DB_PRINT( "setWindows( x0=%d, y0=%d, x1=%d, y1=%d, mode=%d", x0,y0,x1,y1,mode );
    // clip to TFT-Dimensions
    x0 = _min( x0, (uint16_t) (_maxX-1) );
    x1 = _min( x1, (uint16_t) (_maxX-1) );
    y0 = _min( y0, (uint16_t) (_maxY-1) );
    y1 = _min( y1, (uint16_t) (_maxY-1) );
    _orientCoordinates(x0, y0);
    _orientCoordinates(x1, y1);

    if (x1<x0) _swap(x0, x1);
    if (y1<y0) _swap(y0, y1);
    
    startWrite();
    // autoincrement mode
    if ( _orientation > 0 ) mode = modeTab[_orientation-1][mode];
    _writeRegister(ILI9225_ENTRY_MODE, 0x1000 | ( mode<<3) );
    _writeRegister(ILI9225_HORIZONTAL_WINDOW_ADDR1,x1);
    _writeRegister(ILI9225_HORIZONTAL_WINDOW_ADDR2,x0);

    _writeRegister(ILI9225_VERTICAL_WINDOW_ADDR1,y1);
    _writeRegister(ILI9225_VERTICAL_WINDOW_ADDR2,y0);
    DB_PRINT( "gedreht: x0=%d, y0=%d, x1=%d, y1=%d, mode=%d", x0,y0,x1,y1,mode );
    // starting position within window and increment/decrement direction
    switch ( mode>>1 ) {
      case 0:
        _writeRegister(ILI9225_RAM_ADDR_SET1,x1);
        _writeRegister(ILI9225_RAM_ADDR_SET2,y1);
        break;
      case 1:
        _writeRegister(ILI9225_RAM_ADDR_SET1,x0);
        _writeRegister(ILI9225_RAM_ADDR_SET2,y1);
        break;
      case 2:
        _writeRegister(ILI9225_RAM_ADDR_SET1,x1);
        _writeRegister(ILI9225_RAM_ADDR_SET2,y0);
        break;
      case 3:
        _writeRegister(ILI9225_RAM_ADDR_SET1,x0);
        _writeRegister(ILI9225_RAM_ADDR_SET2,y0);
        break;
    }
    _writeCommand16( ILI9225_GRAM_DATA_REG );

    //_writeRegister(ILI9225_RAM_ADDR_SET1,x0);
    //_writeRegister(ILI9225_RAM_ADDR_SET2,y0);

    //_writeCommand(0x00, 0x22);

    endWrite();
}


void TFT_22_ILI9225::_resetWindow() {
    _writeRegister(ILI9225_HORIZONTAL_WINDOW_ADDR1, 0x00AF); 
    _writeRegister(ILI9225_HORIZONTAL_WINDOW_ADDR2, 0x0000); 
    _writeRegister(ILI9225_VERTICAL_WINDOW_ADDR1, 0x00DB); 
    _writeRegister(ILI9225_VERTICAL_WINDOW_ADDR2, 0x0000); 

}

void TFT_22_ILI9225::clear() {
    uint8_t old = _orientation;
    setOrientation(0);
    fillRectangle(0, 0, _maxX - 1, _maxY - 1, COLOR_BLACK);
    setOrientation(old);
    _delay(10);
}


void TFT_22_ILI9225::invert(boolean flag) {
    startWrite();
    _writeCommand16(flag ? ILI9225C_INVON : ILI9225C_INVOFF);
    //_writeCommand(0x00, flag ? ILI9225C_INVON : ILI9225C_INVOFF);
    endWrite();
}


void TFT_22_ILI9225::setBacklight(boolean flag) {
    // THIS FUNCTION DOES NOTHING AT THE MOMENT
    blState = flag;
    // Update PWM duty cycle (based on _brightness) of LED pin on display here if you want to implement LED control.
}


void TFT_22_ILI9225::setBacklightBrightness(uint8_t brightness) {
    // THIS FUNCTION DOES NOTHING AT THE MOMENT
    _brightness = brightness;
    setBacklight(blState);
}


void TFT_22_ILI9225::setDisplay(boolean flag) {
    if (flag) {
        startWrite();
        _writeRegister(0x00ff, 0x0000);
        _writeRegister(ILI9225_POWER_CTRL1, 0x0000);
        endWrite();
        _delay(50);
        startWrite();
        _writeRegister(ILI9225_DISP_CTRL1, 0x1017);
        endWrite();
        _delay(200);
    } else {
        startWrite();
        _writeRegister(0x00ff, 0x0000);
        _writeRegister(ILI9225_DISP_CTRL1, 0x0000);
        endWrite();
        _delay(50);
        startWrite();
        _writeRegister(ILI9225_POWER_CTRL1, 0x0003);
        endWrite();
        _delay(200);
    }
}


