IsaiahGrace/TFT_22_ILI9225_STM32F0/src/TFT_22_ILI9225.cpp
void TFT_22_ILI9225::drawXBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t color, uint16_t bg) {
    _drawBitmap( x,  y, bitmap,  w,  h, color,  bg, false, true, true );
}


// internal function for drawing bitmaps with/without transparent bg, or from ram or progmem
void TFT_22_ILI9225::_drawBitmap(int16_t x, int16_t y,
const uint8_t *bitmap, int16_t w, int16_t h, uint16_t color, uint16_t bg, bool transparent, bool progmem,bool Xbit) {
    bool noAutoInc = false;     // Flag set when transparent pixel was 'written'
    int16_t i, j, byteWidth = (w + 7) / 8;
    int16_t wx0,wy0,wx1,wy1,wh,ww;  // Window-position and size
    uint8_t byte, maskBit;
    maskBit = Xbit? 0x01:0x80;
    // adjust window hight/width to displaydimensions
    DB_PRINT( "DrawBitmap.. maxX=%d, maxY=%d", _maxX,_maxY );
    wx0 = x<0?0:x;
    wy0 = y<0?0:y;
    wx1 = (x+w>_maxX?_maxX:x+w)-1;
    wy1 = (y+h>_maxY?_maxY:y+h)-1;
    wh  = wy1-wy0 +1;
    ww  = wx1-wx0 +1;
    _setWindow( wx0,wy0,wx1,wy1,L2R_TopDown);
    startWrite();
    for (j = y>=0?0:-y; j < (y>=0?0:-y)+wh; j++) {
        for (i = 0; i < w; i++ ) {
            if (i & 7) { if ( Xbit ) byte >>=1; else byte <<= 1; }
            else {  if ( progmem ) byte   = pgm_read_byte(bitmap + j * byteWidth + i / 8);
                    else      byte   = bitmap[j * byteWidth + i / 8];
            }
            if ( x+i >= wx0 && x+i <= wx1 ) {
                // write only if pixel is within window
                if (byte & maskBit) {
                    if (noAutoInc) {
                        //there was a transparent area, set pixelkoordinates again
                        drawPixel(x + i, y + j, color);
                        noAutoInc = false;
                    }
                    else  { 
                        _writeData16(color);
                    }
                }
                else  {
                    if (transparent) noAutoInc = true; // no autoincrement in transparent area!
                    else _writeData16( bg);
                }
            }
        }
    }
    endWrite();
}



//Draw XBitMap Files (*.xbm), exported from GIMP,
//Usage: Export from GIMP to *.xbm, rename *.xbm to *.c and open in editor.
//C Array can be directly used with this function
/*void TFT_22_ILI9225::drawXBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t color) {

    int16_t i, j, byteWidth = (w + 7) / 8;
    uint8_t byte;

    startWrite();
    for (j = 0; j < h; j++) {
        for (i = 0; i < w; i++ ) {
            if (i & 7) byte >>= 1;
            else      byte   = pgm_read_byte(bitmap + j * byteWidth + i / 8);
            if (byte & 0x01) drawPixel(x + i, y + j, color);
        }
    }
    endWrite();
}
*/

//High speed color bitmap
void TFT_22_ILI9225::drawBitmap(uint16_t x1, uint16_t y1, 
const uint16_t** bitmap, int16_t w, int16_t h) {
    _setWindow(x1, y1, x1+w, y1+h);
    startWrite();
    SPI_DC_HIGH();
    SPI_CS_LOW();
    for (uint16_t x = 0; x < w; x++) {
        for (uint16_t y = 0; y < h; y++) {
            uint16_t col = bitmap[x][y];
            _spiWrite(col>>8);
            _spiWrite(col);
        }
    }
    SPI_CS_HIGH();
    endWrite();
}

//High speed color bitmap
void TFT_22_ILI9225::drawBitmap(uint16_t x1, uint16_t y1, 
uint16_t** bitmap, int16_t w, int16_t h) {
    _setWindow(x1, y1, x1+w, y1+h);
    startWrite();
    SPI_DC_HIGH();
    SPI_CS_LOW();
    for (uint16_t x = 0; x < w; x++) {
        for (uint16_t y = 0; y < h; y++) {
            uint16_t col = bitmap[x][y];
            _spiWrite(col>>8);
            _spiWrite(col);
        }
    }
    SPI_CS_HIGH();
    endWrite();
}

void TFT_22_ILI9225::startWrite(void){
    if (writeFunctionLevel++ == 0) {
        //SPI_BEGIN_TRANSACTION(); //TODO: Confirm that this is not necessary
        SPI_CS_LOW();
    }
}


void TFT_22_ILI9225::endWrite(void){
    if (--writeFunctionLevel == 0) {
        SPI_CS_HIGH();
        //SPI_END_TRANSACTION(); //TODO: Confirm that this is not necessary
    }
}


// TEXT- AND CHARACTER-HANDLING FUNCTIONS ----------------------------------

// It seems at first glance that GFX fonts are an Arduino thing...

//void TFT_22_ILI9225::setGFXFont(const GFXfont *f) {
//    gfxFont = (GFXfont *)f;
//}


// Draw a string
//void TFT_22_ILI9225::drawGFXText(int16_t x, int16_t y, STRING s, uint16_t color) {
//
//    int16_t currx = x;
//
//    if(gfxFont) {
//        // Print every character in string
//        #ifdef USE_STRING_CLASS
//        for (uint8_t k = 0; k < s.length(); k++) {
//            currx += drawGFXChar(currx, y, s.charAt(k), color) + 1;
//        }
//        #else
//        for (uint8_t k = 0; k < strlen(s); k++) {
//            currx += drawGFXChar(currx, y, s[k], color) + 1;
//        }
//        #endif
//    }
//}


// Draw a character
//uint16_t TFT_22_ILI9225::drawGFXChar(int16_t x, int16_t y, unsigned char c, uint16_t color) {
//
//    c -= (uint8_t)pgm_read_byte(&gfxFont->first);
//    GFXglyph *glyph  = &(((GFXglyph *)pgm_read_pointer(&gfxFont->glyph))[c]);
//    uint8_t  *bitmap = (uint8_t *)pgm_read_pointer(&gfxFont->bitmap);
//
//    uint16_t bo = pgm_read_word(&glyph->bitmapOffset);
//    uint8_t  w  = pgm_read_byte(&glyph->width),
//             h  = pgm_read_byte(&glyph->height),
//             xa = pgm_read_byte(&glyph->xAdvance);
//    int8_t   xo = pgm_read_byte(&glyph->xOffset),
//             yo = pgm_read_byte(&glyph->yOffset);
//    uint8_t  xx, yy, bits = 0, bit = 0;
//
//    // Add character clipping here one day
//
//    startWrite();
//    for(yy=0; yy<h; yy++) {
//        for(xx=0; xx<w; xx++) {
//            if(!(bit++ & 7)) {
//                bits = pgm_read_byte(&bitmap[bo++]);
//            }
//            if(bits & 0x80) {
//                drawPixel(x+xo+xx, y+yo+yy, color);
//            }
//            bits <<= 1;
//        }
//    }
//    endWrite();
//
//    return (uint16_t)xa;
//}


//void TFT_22_ILI9225::getGFXCharExtent(uint8_t c, int16_t *gw, int16_t *gh, int16_t *xa) {
//    uint8_t first = pgm_read_byte(&gfxFont->first),
//            last  = pgm_read_byte(&gfxFont->last);
//    // Char present in this font?
//    if((c >= first) && (c <= last)) {
//        GFXglyph *glyph = &(((GFXglyph *)pgm_read_pointer(&gfxFont->glyph))[c - first]);
//        *gw = pgm_read_byte(&glyph->width);
//        *gh = pgm_read_byte(&glyph->height);
//        *xa = pgm_read_byte(&glyph->xAdvance);
//        // int8_t  xo = pgm_read_byte(&glyph->xOffset),
//        //         yo = pgm_read_byte(&glyph->yOffset);
//    }
//}


//void TFT_22_ILI9225::getGFXTextExtent(STRING str, int16_t x, int16_t y, int16_t *w, int16_t *h) {
//    *w  = *h = 0;
//    #ifdef USE_STRING_CLASS
//    for (uint8_t k = 0; k < str.length(); k++) {
//        uint8_t c = str.charAt(k);
//    #else
//    for (uint8_t k = 0; k < strlen(str); k++) {
//        uint8_t c = str[k];
//    #endif
//        int16_t gw, gh, xa;
//        getGFXCharExtent(c, &gw, &gh, &xa);
//        if(gh > *h) {
//            *h = gh;
//        }
//        *w += xa;
//    }
//}

